苏州市越球建筑防水材料有限公司
江苏莱德建材股份有限公司
苏州卓宝科技有限公司
苏州市月星建筑防水材料有限公司

苏州市姑苏新型建材有限公司
苏州市姑苏新型建材有限公司	778686533	江苏省苏州市相城区黄桥镇旺方路	苏州市相城区黄桥镇旺方路	 建筑防水卷材	 沥青纸胎油毡、改性沥青防水卷材	（苏）XK08-005-00051	7/8/2016	7/7/2021		

吴江侨华建筑材料厂
吴江侨华建筑材料厂	138246927	江苏省苏州市吴江区七都镇群幸村	七都镇群幸村	 建筑防水卷材	 沥青纸胎油毡、改性沥青防水卷材	（苏）XK08-005-00113	7/19/2016	7/18/2021		

吴江市星球防水环保材料有限公司
吴江市星球防水环保材料有限公司	559289562	江苏省吴江市震泽镇八都林港村	吴江市震泽镇八都林港村	 建筑防水卷材	 建筑防水卷材	（苏）XK08-005-00046	6/6/2016	6/5/2021		

江苏郑凯鑫建材科技有限公司
江苏郑凯鑫建材科技有限公司	251663175	江苏省苏州市相城区渭塘镇凤凰泾村	苏州市相城区渭塘镇凤凰泾村	 建筑防水卷材	 建筑防水卷材	(苏)xk08-005-00017	12/19/2014	12/18/2019		

常熟市三恒建材有限责任公司
常熟市三恒建材有限责任公司	251448934	常昆工业园南新路22号	常昆工业园南新路22号	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00012	12/2/2014	11/30/2019		

江苏凯伦建材股份有限公司
江苏凯伦建材股份有限公司	57817586X	江苏省吴江市七都镇港东开发区	江苏省吴江市七都镇港东开发区	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00068	7/16/2012	7/15/2017		

常熟佳发化学有限责任公司
常熟佳发化学有限责任公司	743709694	常熟市东南开发区富春江路1号	常熟市东南开发区富春江路1号	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00087	1/8/2014	5/15/2018		

苏州市力星防水材料有限公司
苏州市力星防水材料有限公司	728006616	江苏省苏州市吴江区七都镇心田湾	江苏省苏州市吴江区七都镇心田湾	 建筑防水卷材	 建筑防水卷材	XK08-005-00023	4/15/2015	4/13/2020		

苏州市德威防水科技有限公司
苏州市德威防水科技有限公司	596922240	江苏省吴江市七都镇双塔桥村	江苏省吴江市七都镇双塔桥村	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00085	4/8/2013	4/7/2018		

苏州华苏塑料有限公司
苏州华苏塑料有限公司	60823709X	太仓市太仓港港口开发区华苏路	太仓市太仓港港口开发区华苏路	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00095	1/26/2014	1/25/2019		

苏州市虹枫环保防水科技有限公司
苏州市虹枫环保防水科技有限公司	61808791	江苏省苏州市吴江区七都镇望湖村18组	江苏省苏州市吴江区七都镇望湖村18组	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00090	5/22/2013	5/21/2018		

昆山科顺防水材料有限公司
昆山科顺防水材料有限公司	608274990	江苏省昆山市巴城镇石牌工商管理区	江苏省昆山市巴城镇石牌工商管理区	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00010	7/15/2014	7/14/2019		

苏州居宝防水涂料有限公司
苏州居宝防水涂料有限公司	753904100	清砂路（清港村）	苏州市吴中区甪直镇清砂路（清港村）	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00071	3/3/2014	3/2/2019		

苏州华特防水材料有限公司
苏州华特防水材料有限公司	713233947	江苏省苏州市吴中区临湖浦庄联盟街15号	江苏省苏州市吴中区临湖浦庄联盟街15号	 建筑防水卷材	 建筑防水卷材	(苏)XK08-005-00098	5/15/2014	5/14/2019		

上海豫宏建筑防水材料有限公司太仓分公司
上海豫宏建筑防水材料有限公司太仓分公司	589996380	太仓市浮桥民营小区红星路东侧	太仓市浮桥民营小区红星路东侧	 建筑防水卷材	 建筑防水卷材	(沪)XK08-005-00007	9/11/2014	9/10/2019		
